In [23]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

a=pd.read_csv("employee_datas.csv")
a.head()

,Serial No,Employee Name,Age,Experience in Years,Estimated Salary,Monthly Expenditure
0,1,Lynn Sanchez,33,10,50000,16600
1,2,Sasha Carter,52,28,86000,20400
2,3,Cameron Lee,57,12,54000,21400
3,4,Jordan Clark,47,3,36000,19400
4,5,Kelly Perez,28,5,40000,15600

In [24]:
x=a.iloc[:,[2,4]]
y=a.iloc[:,5]

In [25]:
print(x.isnull().sum())

Age                 0
Estimated Salary    0
dtype: int64

In [26]:
print(y.isnull().sum())

0

In [27]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test = train_test_split(x,y,test_size=0.2)

In [ ]:
from sklearn.svm import SVC
clf=SVC(kernel='linear')
clf.fit(x_train,y_train)
y_pred=clf.predict(x_test)

In [22]:
from sklearn.metrics import accuracy_score
accuracy=accuracy_score(y_test,y_pred)
print(accuracy)

0.0